##Basic data types

In [1]:
type(1)

int

In [2]:
type(1.0)

float

In [3]:
type("Star Wars: The Rise of Skywalker")

str

In [4]:
type("3")

str

In [5]:
type(False)

bool

In [6]:
type (True)

bool

# Outline
- Boolean review
- Comparison operators
- And and Or

In [7]:
x = True
y = False
x+2

3

In [8]:
y+2

2

In [9]:
y+x

1

In [10]:
m = int(x)
print(m)

1

In [11]:
n = int(y)
print(y)

False

## Operations

In [12]:
False + True

1

In [13]:
type(False + True)

int

In [14]:
1+2

3

In [15]:
"Kale" + "Spinach"

'KaleSpinach'

##Errors

In [16]:
"Kale"-"Spinach"

TypeError: unsupported operand type(s) for -: 'str' and 'str'

## Chaning the data type

In [17]:
type(15)

int

In [18]:
float(15)

15.0

In [19]:
x = 15
type(x)

int

In [20]:
y = float(x)
type(y)

float

In [21]:
str(12)

'12'

In [22]:
z = bool(123)
print(z)

True

In [23]:
n = bool(0)
print(n)

False

In [24]:
m = bool(-2)
print(m)

True

# Comparison operators
# == Checks for equality
# < Less than
# > Greater than
# >= Greater than or equal to
# <= Less than or equal to
# != Does not equal
Logical operators
True and True
False and False
True and False
True or True
True or False

In [26]:
not True

False

In [27]:
not False

True

In [28]:
True and True and False and True

False

In [29]:
True and True or False

True

## List examples and use cases

In [30]:
my_list = [1,2,3,4]
type(my_list)

list

In [31]:
dec_temperatures = ["Dec 10",20, "Dec 11", 22, "Dec 12", 21, "Dec 13", 19, "Dec 14", 13, "Dec 15", 21]
dec_temperatures_mood = ["Dec 10",20, True, "Dec 11", 22, True, "Dec 12", 21, True, "Dec 13", 19, False, "Dec 14", 13, False, "Dec 15", 21, True]

In [32]:
dec_temperatures_mood[0]

'Dec 10'

In [33]:
dec_temperatures_mood[5]

True

In [34]:
type(dec_temperatures_mood[3])

str

##Subsetting several data points (Slicing)
#First index is inclusive, last index is exclusive

In [38]:
#Subsetting in reverse
dec_temperatures_mood[-1]

True

In [36]:
dec_temperatures_mood[-3:-1]

['Dec 15', 21]

In [37]:
#Subsetting with no start or stop bound
dec_temperatures_mood[1:]

[20,
 True,
 'Dec 11',
 22,
 True,
 'Dec 12',
 21,
 True,
 'Dec 13',
 19,
 False,
 'Dec 14',
 13,
 False,
 'Dec 15',
 21,
 True]

In [40]:
# List of lists which include the date, temperature, and whether you were in a positive mood
dec_temperatures_mood = [["Dec 10",20, True], ["Dec 11", 22, True], ["Dec 12", 21, True], ["Dec 13", 19, False], ["Dec 14", 13, False], ["Dec 15", 21, True]]
dec_temperatures_mood[:3]

[['Dec 10', 20, True], ['Dec 11', 22, True], ['Dec 12', 21, True]]

##Updating Data in a List

In [41]:
# List of lists which include the date, temperature, and whether you were in a positive mood
dec_temperatures_mood = [["Dec 10",20, True], ["Dec 11", 22, True], ["Dec 12", 21, True], ["Dec 13", 19, False], ["Dec 14", 13, False], ["Dec 15", 21, True]]

In [42]:
dec_temperatures_mood + [['Dec 16', 18, False]]

[['Dec 10', 20, True],
 ['Dec 11', 22, True],
 ['Dec 12', 21, True],
 ['Dec 13', 19, False],
 ['Dec 14', 13, False],
 ['Dec 15', 21, True],
 ['Dec 16', 18, False]]

In [43]:
# Notice that above we used [[]] because were were adding a list data type to the list. 
# What if we just used single brackets? What do you think would happen?

dec_temperatures_mood + ['Dec 16', 18, False]

[['Dec 10', 20, True],
 ['Dec 11', 22, True],
 ['Dec 12', 21, True],
 ['Dec 13', 19, False],
 ['Dec 14', 13, False],
 ['Dec 15', 21, True],
 'Dec 16',
 18,
 False]

In [44]:
print(dec_temperatures_mood)

[['Dec 10', 20, True], ['Dec 11', 22, True], ['Dec 12', 21, True], ['Dec 13', 19, False], ['Dec 14', 13, False], ['Dec 15', 21, True]]

In [45]:
# Save the list with the updated data
dec_temperatures_mood = dec_temperatures_mood + [['Dec 16', 18, False]]

In [46]:
#Print the new list to confirm that the data was added
print(dec_temperatures_mood)

[['Dec 10', 20, True], ['Dec 11', 22, True], ['Dec 12', 21, True], ['Dec 13', 19, False], ['Dec 14', 13, False], ['Dec 15', 21, True], ['Dec 16', 18, False]]

In [52]:
# Delete the last elememt
del(dec_temperatures_mood[-1])

#Replace it with ['Dec 16', 18, True]
dec_temperatures_mood = dec_temperatures_mood + ['Dec 16', 18, True]
print(dec_temperatures_mood)

[['Dec 10', 20, True], ['Dec 11', 22, True], ['Dec 12', 21, True], ['Dec 13', 19, False], ['Dec 14', 13, False], 'Dec 16', 18, 'Dec 16', 18, True]

In [53]:
#Instead of deleting and replacing, update with subsetting
dec_temperatures_mood[-1] = ['Dec 16', 18, True]
print(dec_temperatures_mood)

[['Dec 10', 20, True], ['Dec 11', 22, True], ['Dec 12', 21, True], ['Dec 13', 19, False], ['Dec 14', 13, False], 'Dec 16', 18, 'Dec 16', 18, ['Dec 16', 18, True]]

##Tuples: immutable(cannot be modified) and using Parentheses

In [54]:
#tuple example
et_characters = ('et', 'gertie','elliot','michael','mary')

In [56]:
#unpack the et_characters tuple
patricia, drew, henry, robert, dee = et_characters
print(robert)

michael

## Dictionaries: maps a set of objects to another set of objects; key-value pairs

In [58]:
#list of dates
dates = ["Dec 10", "Dec 11", "Dec 12", "Dec 13", "Dec 14","Dec 15"]
#list of temperatures
temperatures = [20,22,21,19,13,21]
# Find the index of Dec 14 with the .index method
dates.index("Dec 14")

4

In [59]:
#Find the temperature with that index in the temperatures list
temperatures[4]

13

In [60]:
#list of dates and temperatures 
dec_temperatures = ["Dec 10",20, "Dec 11", 22, "Dec 12", 21, "Dec 13", 19, "Dec 14", 13, "Dec 15", 21]
# list of lists of dates and temperatures
dec_temperatures = [["Dec 10",20], ["Dec 11", 22], ["Dec 12", 21], ["Dec 13", 19], ["Dec 14", 13], ["Dec 15", 21]]

In [64]:
dec_temps={
    "Dec 10":20,
    "Dec 11":22,
    "Dec 12":21,
    "Dec 13":19,
    "Dec 14":13,
    "Dec 15":21
}

# dictionary name with the key in square brackets
dec_temps['Dec 14']

13

## Functions and Arguments

In [65]:
max("bb", "ba")

'bb'

In [67]:
round(1.623)

2

In [68]:
x = [1,2,3,-1]
result = map(abs, x)
print(list(result))

[1, 2, 3, 1]

In [69]:
#List1
college = ['Columbia','Stanford','Hunter','NYU']

#List2
accepted = [True, False, True, True]

#List of tuples
list_of_tuples = list(zip(college,accepted))

print(list_of_tuples)

[('Columbia', True), ('Stanford', False), ('Hunter', True), ('NYU', True)]

## Python documentation
https://docs.python.org/3/library/functions.html

## 1.12 Method
similar to regular functions; belongs to a specific type

In [70]:
# Common methods and method notation
#After the data, write a dot, the function name, followed by parenthases
#string methods
name = "emma watson"
name.upper()

'EMMA WATSON'

In [72]:
name.capitalize()

'Emma watson'

In [73]:
name.replace('watson','robert')

'emma robert'

In [74]:
name.find('watson')

5

In [75]:
#float methods
x = 123.4
x.is_integer()

False

In [79]:
#list methods
dec_temperatures_mood = ["Dec 10",20, True, "Dec 11", 22, True, "Dec 12", 21, True, "Dec 13", 19, False, "Dec 14", 13, False, "Dec 15", 21, True]
dec_temperatures_mood.count(20)

1

In [81]:
dec_temperatures_mood.append("Dec 16")
dec_temperatures_mood.append(18)
dec_temperatures_mood.append(True)
print(dec_temperatures_mood)

['Dec 10', 20, True, 'Dec 11', 22, True, 'Dec 12', 21, True, 'Dec 13', 19, False, 'Dec 14', 13, False, 'Dec 15', 21, True, 'Dec 16', 18, True]

## 1.13 User-defined function syntax
def function_name()
        function body with code
        specifying what the function does

In [82]:
def hello_world():
    """Prints out Hello, World!"""
    x = "Hello, " + "World!"
    print(x)

In [83]:
hello_world()

Hello, World!

In [84]:
def hello_name(name):
    x = "Hello, " + name
    print(x)

In [85]:
hello_name('Kate')

Hello, Kate

In [86]:
def greeting(greeting, name):
    x = greeting + name
    print(x)

In [87]:
greeting("Good morning, ", "George!")

Good morning, George!

In [88]:
greeting(name = "Kelly", greeting = "Hello, ")

Hello, Kelly

## 1.5 Conditions: If, Else, Elif - run in order once, use this if your code doesn't change the data
While: loops as long as the condition is still true; Use this if your code change your data
For loop with conditional; range() function; works with iterable(an object capable of returning its members one at a time like Lists, tuples, strings, dictionary)

In [89]:
def score_description(score):
    if score > 65:
        print("You passed the test!")

In [90]:
score_description(80)

You passed the test!

In [91]:
score_description(40)

In [92]:
def score_description(score):
    if score > 65:
        print("You passed the test!")
    else:
        print("You failed the test!")

In [93]:
score_description(40)

You failed the test!

In [94]:
def letter_grade(score):
    if score <= 100 and score >93:
        print("A")
    elif score <= 93 and score > 83:
        print("B")
    else:
        print("F")

In [95]:
x = 9
if x == 9:
    print(x+1)
elif x < 10:
    print(x+2)
else:
   print(x+3)

10

In [96]:
x = 2
while x < 1000:
    x = x*10
    print(x)

20
200
2000

In [97]:
y = 2

while y < 1000:
    y = y*10
    print(y)

20
200
2000

In [98]:
def subtract_one(x):
    while x > 2:
        x = x - 1
        print(x)

In [99]:
subtract_one(5)

4
3
2

In [100]:
def subtract_one(x):
    while x > 2:
        x = x - 1
        print(x)
    else:
        print('X is no longer greater than 2!')

In [101]:
subtract_one(5)

4
3
2
X is no longer greater than 2!

In [102]:
test_scores = [40,65,91,92,93]
for score in test_scores:
    score + 7
print(test_scores)

[40, 65, 91, 92, 93]

In [103]:
for letter in "LOL":
    print(letter + "!")

L!
O!
L!

In [104]:
my_list = [1,2,3,4,5]
for number in my_list:
    number = number*2
    print(number)

2
4
6
8
10

In [105]:
for number in range(1,101):
        number = number*2
        print(number)

2
4
6
8
10
12
14
16
18
20
22
24
26
28
30
32
34
36
38
40
42
44
46
48
50
52
54
56
58
60
62
64
66
68
70
72
74
76
78
80
82
84
86
88
90
92
94
96
98
100
102
104
106
108
110
112
114
116
118
120
122
124
126
128
130
132
134
136
138
140
142
144
146
148
150
152
154
156
158
160
162
164
166
168
170
172
174
176
178
180
182
184
186
188
190
192
194
196
198
200

In [106]:
for score in test_scores:
    if score < 80:
        score = score + 7
    print(score)

47
72
91
92
93

In [107]:
def score_curve(test_scores):
    for score in test_scores:
        if score < 80:
            score = score + 7
        print(score)

In [108]:
score_curve([1,2,90])

8
9
90

In [109]:
test_scores_dict = {'George':40,
                   'Jerry':65,
                   'Elaine':91,
                   'Kramer': 92,
                   'Newman':93}

In [111]:
for name, score in test_scores_dict.items():
    score = score+7
    print(name+": "+str(score))

George: 47
Jerry: 72
Elaine: 98
Kramer: 99
Newman: 100

## 1.19 NumPy
Stands for numeric python
Includes the data type array
Sophisticated functions
Linear algebra and random number capabilities
array note: - Can only contain 1 data type
- Can index, subset, slice, use comparison operators the same way as a list

In [114]:
#import numpy aliased as np
import numpy as np

#List of masses
mass = [12, 20,32]

#List of volumes
volume = [36, 18, 10]

#create a mass array
mass_array=np.array(mass)
#create a volume array
volume_array=np.array(volume)

In [116]:
#find the densities
density = mass_array/volume_array
print(density)

[0.33333333 1.11111111 3.2       ]

In [117]:
#Create a 2D NumPy array from a list of lists
massvolume = [[12,20,32], [36, 18, 10]]

In [118]:
type(massvolume)

list

In [119]:
massvolume_array = np.array(massvolume)
type(massvolume_array)

numpy.ndarray

In [120]:
print(massvolume_array)

[[12 20 32]
 [36 18 10]]

In [121]:
# See how many rows and columns there are 
massvolume_array.shape

(2, 3)

In [122]:
# Subsetting a 2D NumPy array
massvolume_array[1,2]

10

In [123]:
massvolume_array[0]

array([12, 20, 32])

In [124]:
massvolume_array[0:2, 1:3]

array([[20, 32],
       [18, 10]])

In [125]:
for mass in mass_array:
    weight = mass * 9.8
    print(weight)

117.60000000000001
196.0
313.6

In [126]:
for value in massvolume_array:
    print(value)

[12 20 32]
[36 18 10]

In [127]:
#use nditer function to loop through a 2D numpy array
for value in np.nditer(massvolume_array):
    print(value)

12
20
32
36
18
10

In [128]:
for value in np.nditer(massvolume_array[0]):
    weight = value*9.8
    print(weight)

117.60000000000001
196.0
313.6

## 1.22 Pandas 
DataFrame

In [129]:
import pandas as pd
#Sample dictionary of names and ages

my_dict = {
    'college':['Columbia','Stanford','Hunter','NYU'],
    'accepted':[True,False,True,True]
}

#Convert dictionary to dataframe
my_df = pd.DataFrame(my_dict)
print(my_df)

print(my_dict)

    college  accepted
0  Columbia      True
1  Stanford     False
2    Hunter      True
3       NYU      True
{'college': ['Columbia', 'Stanford', 'Hunter', 'NYU'], 'accepted': [True, False, True, True]}

In [130]:
#List of lists
list_of_lists = [['Columbia', True], ['Stanford', False], ['Hunter', True],['NYU', True]]

#Create DataFrame
my_df = pd.DataFrame(list_of_lists, columns = ['college','accepted'])

print(my_df)

    college  accepted
0  Columbia      True
1  Stanford     False
2    Hunter      True
3       NYU      True

In [131]:
df = pd.read_csv('./January 3-10, 2018 - Core Trends Survey - CSV.csv')

In [132]:
social = pd.read_csv('./January 3-10, 2018 - Core Trends Survey - CSV.csv')

In [137]:
#Slicing with square brackets
type(social[['pial11ao@']])

pandas.core.frame.DataFrame

In [138]:
social[['pial11','pial11ao@']]

      pial11                                          pial11ao@
0          1  information has become available more frequent...
1          8
2          1                        it connects people together
3          2                      kids spend to much time on it
4          1           it's just another tool for people to use
...      ...                                                ...
1997       1      its made data available for people to look at
1998       1                  connection with people and things
1999       3
2000       1    access to broader group of facts and activities
2001       2  Because most platforms make money by psycholog...

[2002 rows x 2 columns]

In [139]:
social[0:3]

,respid,sample,comp,int_date,lang,cregion,state,density,usr,qs1,...,inc,party,partyln,hh1,hh3,ql1,ql1a,qc1,weight,cellweight
0,1,1,1,180103,1,1,42,5,U,,...,6,2,,5,4,1,,,1.746359,
1,2,1,1,180103,1,3,45,2,S,,...,4,3,8,2,2,2,2,,1.659764,
2,3,1,1,180103,1,1,34,5,S,,...,4,1,,1,,1,,,0.490804,

In [140]:
#Slicing with .loc
social.loc[:,'pial11':'pial11ao@']

      pial11 pial11a                                          pial11ao@
0          1       1  information has become available more frequent...
1          8
2          1       1                        it connects people together
3          2       1                      kids spend to much time on it
4          1       1           it's just another tool for people to use
...      ...     ...                                                ...
1997       1       1      its made data available for people to look at
1998       1       1                  connection with people and things
1999       3
2000       1       1    access to broader group of facts and activities
2001       2       1  Because most platforms make money by psycholog...

[2002 rows x 3 columns]

In [142]:
#Slicing with .iloc
social.iloc[:,1]

0       1
1       1
2       1
3       1
4       1
       ..
1997    2
1998    2
1999    2
2000    2
2001    2
Name: sample, Length: 2002, dtype: int64

In [144]:
under35 = social["age"]<35
social[under35]

,respid,sample,comp,int_date,lang,cregion,state,density,usr,qs1,...,inc,party,partyln,hh1,hh3,ql1,ql1a,qc1,weight,cellweight
0,1,1,1,180103,1,1,42,5,U,,...,6,2,,5,4,1,,,1.746359,
17,24,1,1,180103,1,1,42,3,S,,...,1,3,2,2,2,1,,,0.868269,
23,31,1,1,180103,1,1,36,3,S,,...,2,1,,6,2,1,,,1.589968,
40,54,1,1,180103,1,1,9,3,S,,...,2,3,8,5,2,1,,,1.106568,
45,60,1,1,180105,1,2,26,2,S,,...,6,3,2,4,4,1,,,1.974981,
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1990,102417,2,1,180110,1,4,6,3,S,2,...,9,3,2,3,2,,,2,1.596377,1.2080228
1991,102418,2,1,180110,1,4,6,5,U,2,...,98,4,8,4,2,,,1,2.112972,2.0428872
1995,102422,2,1,180110,1,4,6,5,,2,...,99,3,2,9,9,,,2,1.432637,.9011761
1996,102424,2,1,180110,1,4,2,1,R,2,...,4,8,8,6,3,,,2,1.897345,1.8468294
2001,102430,2,1,180110,1,4,6,5,U,2,...,6,4,9,2,2,,,2,1.226239,.9230263

In [145]:
import pandas as pd
import numpy as np

In [153]:
df = pd.read_csv('./January 3-10, 2018 - Core Trends Survey - CSV.csv')
df=df.apply(pd.to_numeric, errors='coerce')

df = df.replace([' ','',8,9,'NaN'], np.nan)

df.head()

,respid,sample,comp,int_date,lang,cregion,state,density,usr,qs1,...,inc,party,partyln,hh1,hh3,ql1,ql1a,qc1,weight,cellweight
0,1.0,1,1,180103,1,1,42.0,5,NaN,NaN,...,6.0,2.0,NaN,5.0,4.0,1.0,NaN,NaN,1.746359,NaN
1,2.0,1,1,180103,1,3,45.0,2,NaN,NaN,...,4.0,3.0,NaN,2.0,2.0,2.0,2.0,NaN,1.659764,NaN
2,3.0,1,1,180103,1,1,34.0,5,NaN,NaN,...,4.0,1.0,NaN,1.0,NaN,1.0,NaN,NaN,0.490804,NaN
3,4.0,1,1,180103,1,3,24.0,4,NaN,NaN,...,2.0,2.0,NaN,2.0,2.0,1.0,NaN,NaN,0.947965,NaN
4,5.0,1,1,180103,1,1,33.0,2,NaN,NaN,...,7.0,1.0,NaN,3.0,3.0,1.0,NaN,NaN,0.915959,NaN

In [154]:
# see the column names
df.columns

Index(['respid', 'sample', 'comp', 'int_date', 'lang', 'cregion', 'state',
       'density', 'usr', 'qs1', 'sex', 'eminuse', 'intmob', 'intfreq',
       'home4nw', 'bbhome1', 'bbhome2', 'device1a', 'smart2', 'snsint2',
       'device1b', 'device1c', 'device1d', 'web1a', 'web1b', 'web1c', 'web1d',
       'web1e', 'web1f', 'web1g', 'web1h', 'sns2a', 'sns2b', 'sns2c', 'sns2d',
       'sns2e', 'pial5a', 'pial5b', 'pial5c', 'pial5d', 'pial11', 'pial11a',
       'pial11ao@', 'pial11_igbm', 'pial12', 'books1', 'books2a', 'books2b',
       'books2c', 'age', 'marital', 'educ2', 'emplnw', 'hisp', 'racem1',
       'racem2', 'racem3', 'racem4', 'racecmb', 'birth_hisp', 'inc', 'party',
       'partyln', 'hh1', 'hh3', 'ql1', 'ql1a', 'qc1', 'weight', 'cellweight'],
      dtype='object')

In [155]:
#mean
np.mean(df['intfreq'])

2.140370578326783

In [156]:
#median
np.median(df['intfreq'])

nan

In [157]:
#nanmedian
np.nanmedian(df['intfreq'])

2.0

In [158]:
np.corrcoef(df['books1'],df['age'])
np.

array([[nan, nan],
       [nan,  1.]])

In [147]:
df.shape

(2002, 70)

In [148]:
intfreq = list(df['intfreq'].astype(float).dropna().values)
respid = list(df['respid'].astype(int).dropna().values)
sex =  list(df['sex'].astype(int).dropna().values)
age = list(df['age'].astype(int).dropna().values)

In [149]:
intfreq_array = np.array(intfreq)

In [150]:
intfreq_array.shape

(1785,)

In [151]:
social_list = [respid, sex, age, intfreq_array]

In [152]:
social = np.array(social_list)

C:\Users\jdche\AppData\Local\Temp\ipykernel_12864\2393297236.py:1: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray.
  social = np.array(social_list)

## 1.25 Editing Data in DataFrames
setting columns
transforming columns
setting data with loc[]

In [160]:
import pandas as pd
import numpy as np
from pathlib import Path

original_df = pd.read_csv(Path('employee_attrition.csv'))
print(original_df.shape)
original_df.head()

(1470, 26)

,Age,Attrition,BusinessTravel,DailyRate,DistanceFromHome,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,...,PerformanceRating,RelationshipSatisfaction,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,1,2,Female,94,3,2,...,3,1,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,8,3,Male,61,2,2,...,4,4,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,2,4,Male,92,2,1,...,3,2,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,3,4,Female,56,3,1,...,3,3,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,2,1,Male,40,3,1,...,3,4,1,6,3,3,2,2,2,2

In [161]:
import pandas as pd
import numpy as np
from pathlib import Path

original_df = pd.read_csv(Path('employee_attrition.csv'))
print(original_df.shape)
original_df.head()

(1470, 26)

,Age,Attrition,BusinessTravel,DailyRate,DistanceFromHome,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,...,PerformanceRating,RelationshipSatisfaction,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,1,2,Female,94,3,2,...,3,1,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,8,3,Male,61,2,2,...,4,4,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,2,4,Male,92,2,1,...,3,2,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,3,4,Female,56,3,1,...,3,3,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,2,1,Male,40,3,1,...,3,4,1,6,3,3,2,2,2,2

In [162]:
df = original_df.copy()

# This looks like a bad idea, but you can assign one column to another!
df.Gender = df.Age

df # notice the Gender column now displays Age

,Age,Attrition,BusinessTravel,DailyRate,DistanceFromHome,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,...,PerformanceRating,RelationshipSatisfaction,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,1,2,41,94,3,2,...,3,1,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,8,3,49,61,2,2,...,4,4,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,2,4,37,92,2,1,...,3,2,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,3,4,33,56,3,1,...,3,3,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,2,1,27,40,3,1,...,3,4,1,6,3,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,36,No,Travel_Frequently,884,23,3,36,41,4,2,...,3,3,1,17,3,3,5,2,0,3
1466,39,No,Travel_Rarely,613,6,4,39,42,2,3,...,3,1,1,9,5,3,7,7,1,7
1467,27,No,Travel_Rarely,155,4,2,27,87,4,2,...,4,2,1,6,0,3,6,2,0,3
1468,49,No,Travel_Frequently,1023,2,4,49,63,2,2,...,3,4,0,17,3,2,9,6,0,8
1469,34,No,Travel_Rarely,628,8,2,34,82,4,2,...,3,1,0,6,3,4,4,3,1,2

In [163]:
df = original_df.copy()

df = df.drop(columns=['Gender', 'Age'])

df

,Attrition,BusinessTravel,DailyRate,DistanceFromHome,EnvironmentSatisfaction,HourlyRate,JobInvolvement,JobLevel,JobSatisfaction,MaritalStatus,...,PerformanceRating,RelationshipSatisfaction,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,Yes,Travel_Rarely,1102,1,2,94,3,2,4,Single,...,3,1,0,8,0,1,6,4,0,5
1,No,Travel_Frequently,279,8,3,61,2,2,2,Married,...,4,4,1,10,3,3,10,7,1,7
2,Yes,Travel_Rarely,1373,2,4,92,2,1,3,Single,...,3,2,0,7,3,3,0,0,0,0
3,No,Travel_Frequently,1392,3,4,56,3,1,3,Married,...,3,3,0,8,3,3,8,7,3,0
4,No,Travel_Rarely,591,2,1,40,3,1,2,Married,...,3,4,1,6,3,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,No,Travel_Frequently,884,23,3,41,4,2,4,Married,...,3,3,1,17,3,3,5,2,0,3
1466,No,Travel_Rarely,613,6,4,42,2,3,1,Married,...,3,1,1,9,5,3,7,7,1,7
1467,No,Travel_Rarely,155,4,2,87,4,2,2,Married,...,4,2,1,6,0,3,6,2,0,3
1468,No,Travel_Frequently,1023,2,4,63,2,2,2,Married,...,3,4,0,17,3,2,9,6,0,8
1469,No,Travel_Rarely,628,8,2,82,4,2,3,Married,...,3,1,0,6,3,4,4,3,1,2

In [164]:
df = original_df.copy()

df = df.iloc[:,0:4]

df

      Age Attrition     BusinessTravel  DailyRate
0      41       Yes      Travel_Rarely       1102
1      49        No  Travel_Frequently        279
2      37       Yes      Travel_Rarely       1373
3      33        No  Travel_Frequently       1392
4      27        No      Travel_Rarely        591
...   ...       ...                ...        ...
1465   36        No  Travel_Frequently        884
1466   39        No      Travel_Rarely        613
1467   27        No      Travel_Rarely        155
1468   49        No  Travel_Frequently       1023
1469   34        No      Travel_Rarely        628

[1470 rows x 4 columns]

In [165]:
columns = list('abcdef') # Create a list of chars from a string (yay python)
data = [[False for j in columns] for i in range(0, 10)] # create a list of lists of "False"s for our dataframe
sdf = pd.DataFrame(data, columns=columns)

sdf

       a      b      c      d      e      f
0  False  False  False  False  False  False
1  False  False  False  False  False  False
2  False  False  False  False  False  False
3  False  False  False  False  False  False
4  False  False  False  False  False  False
5  False  False  False  False  False  False
6  False  False  False  False  False  False
7  False  False  False  False  False  False
8  False  False  False  False  False  False
9  False  False  False  False  False  False

In [166]:
print(sdf.loc[0, 'a'])

sdf.loc[0, 'a'] = True

sdf

False

       a      b      c      d      e      f
0   True  False  False  False  False  False
1  False  False  False  False  False  False
2  False  False  False  False  False  False
3  False  False  False  False  False  False
4  False  False  False  False  False  False
5  False  False  False  False  False  False
6  False  False  False  False  False  False
7  False  False  False  False  False  False
8  False  False  False  False  False  False
9  False  False  False  False  False  False

In [167]:
sdf.loc[3] = True

sdf

       a      b      c      d      e      f
0   True  False  False  False  False  False
1  False  False  False  False  False  False
2  False  False  False  False  False  False
3   True   True   True   True   True   True
4  False  False  False  False  False  False
5  False  False  False  False  False  False
6  False  False  False  False  False  False
7  False  False  False  False  False  False
8  False  False  False  False  False  False
9  False  False  False  False  False  False

In [168]:
sdf.loc[7, ['a', 'c', 'f']] = True

sdf

       a      b      c      d      e      f
0   True  False  False  False  False  False
1  False  False  False  False  False  False
2  False  False  False  False  False  False
3   True   True   True   True   True   True
4  False  False  False  False  False  False
5  False  False  False  False  False  False
6  False  False  False  False  False  False
7   True  False   True  False  False   True
8  False  False  False  False  False  False
9  False  False  False  False  False  False

In [169]:
sdf.loc[9] = [True, False, True, False, True, False]

sdf

       a      b      c      d      e      f
0   True  False  False  False  False  False
1  False  False  False  False  False  False
2  False  False  False  False  False  False
3   True   True   True   True   True   True
4  False  False  False  False  False  False
5  False  False  False  False  False  False
6  False  False  False  False  False  False
7   True  False   True  False  False   True
8  False  False  False  False  False  False
9   True  False   True  False   True  False

In [170]:
# Here we use the slice operation to select rows 3 and 4, and columns d, e and f
sdf.loc[3:4, 'd':'f'] = [['a','a','a'], ['b','b','b']]

sdf

       a      b      c      d      e      f
0   True  False  False  False  False  False
1  False  False  False  False  False  False
2  False  False  False  False  False  False
3   True   True   True      a      a      a
4  False  False  False      b      b      b
5  False  False  False  False  False  False
6  False  False  False  False  False  False
7   True  False   True  False  False   True
8  False  False  False  False  False  False
9   True  False   True  False   True  False

## 1.28 Combining DataFrames
the union
the join

In [171]:
import pandas as pd

In [172]:
# Let us first define some example tables
df_first_names_1 = pd.DataFrame({'STUDENT_ID':['S1234','S4321'],
                                 'FIRST_NAME':['Daniel', 'Alfredo']})
df_first_names_2 = pd.DataFrame({'STUDENT_ID':['S3333','S4444'],
                                  'FIRST_NAME':['Gertrude', 'Ying']})

df_last_names = pd.DataFrame({'STUDENT_ID':['S4321','S3333','S4444','S5678'],
                                  'LAST_NAME':['Smith', 'Guptda', 'Minard', 'Gonzales']})

In [173]:
df_first_names_1

  STUDENT_ID FIRST_NAME
0      S1234     Daniel
1      S4321    Alfredo

In [174]:
df_first_names_2

  STUDENT_ID FIRST_NAME
0      S3333   Gertrude
1      S4444       Ying

In [175]:
df_last_names

  STUDENT_ID LAST_NAME
0      S4321     Smith
1      S3333    Guptda
2      S4444    Minard
3      S5678  Gonzales

In [176]:
df_first_names = pd.concat([df_first_names_1, df_first_names_2]).reset_index(drop = True)

df_first_names

  STUDENT_ID FIRST_NAME
0      S1234     Daniel
1      S4321    Alfredo
2      S3333   Gertrude
3      S4444       Ying

In [177]:
pd.merge(df_first_names, df_last_names, on = "STUDENT_ID", how = "inner")

  STUDENT_ID FIRST_NAME LAST_NAME
0      S4321    Alfredo     Smith
1      S3333   Gertrude    Guptda
2      S4444       Ying    Minard

In [178]:
pd.merge(df_first_names, df_last_names, on = "STUDENT_ID", how = "outer")

  STUDENT_ID FIRST_NAME LAST_NAME
0      S1234     Daniel       NaN
1      S4321    Alfredo     Smith
2      S3333   Gertrude    Guptda
3      S4444       Ying    Minard
4      S5678        NaN  Gonzales

In [179]:
pd.merge(df_first_names, df_last_names, on = "STUDENT_ID", how = "left")

  STUDENT_ID FIRST_NAME LAST_NAME
0      S1234     Daniel       NaN
1      S4321    Alfredo     Smith
2      S3333   Gertrude    Guptda
3      S4444       Ying    Minard

In [180]:
pd.merge(df_first_names, df_last_names, on = "STUDENT_ID", how = "right")

  STUDENT_ID FIRST_NAME LAST_NAME
0      S4321    Alfredo     Smith
1      S3333   Gertrude    Guptda
2      S4444       Ying    Minard
3      S5678        NaN  Gonzales

## 1.29 Grouping and Aggregating Data
Splitting data into groups
Aggregation

In [182]:
import pandas as pd
df = pd.read_csv('./data/nba.csv')

df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [183]:
#Use groupby() function to group the data based on the â€œTeam".

team = df.groupby("Team")
#print first value in each group
team.first()

,Name,Number,Position,Age,Height,Weight,College,Salary
Team,,,,,,,,
Atlanta Hawks,Kent Bazemore,24.0,SF,26.0,6-5,201.0,Old Dominion,2000000.0
Boston Celtics,Avery Bradley,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Brooklyn Nets,Bojan Bogdanovic,44.0,SG,27.0,6-8,216.0,Oklahoma State,3425510.0
Charlotte Hornets,Nicolas Batum,5.0,SG,27.0,6-8,200.0,Virginia Commonwealth,13125306.0
Chicago Bulls,Cameron Bairstow,41.0,PF,25.0,6-9,250.0,New Mexico,845059.0
Cleveland Cavaliers,Matthew Dellavedova,8.0,PG,25.0,6-4,198.0,Saint Mary's,1147276.0
Dallas Mavericks,Justin Anderson,1.0,SG,22.0,6-6,228.0,Virginia,1449000.0
Denver Nuggets,Darrell Arthur,0.0,PF,28.0,6-9,235.0,Kansas,2814000.0
Detroit Pistons,Joel Anthony,50.0,C,33.0,6-9,245.0,UNLV,2500000.0
Golden State Warriors,Leandro Barbosa,19.0,SG,33.0,6-3,194.0,North Carolina,2500000.0
Houston Rockets,Trevor Ariza,1.0,SF,30.0,6-8,215.0,UCLA,8193030.0
Indiana Pacers,Lavoy Allen,5.0,PF,27.0,6-9,255.0,Temple,4050000.0
Los Angeles Clippers,Cole Aldrich,45.0,C,27.0,6-11,250.0,Kansas,1100602.0
Los Angeles Lakers,Brandon Bass,2.0,PF,31.0,6-8,250.0,LSU,3000000.0
Memphis Grizzlies,Jordan Adams,3.0,SG,21.0,6-5,209.0,UCLA,1404600.0
Miami Heat,Chris Bosh,1.0,PF,32.0,6-11,235.0,Georgia Tech,22192730.0
Milwaukee Bucks,Giannis Antetokounmpo,34.0,SF,21.0,6-11,222.0,Arizona,1953960.0
Minnesota Timberwolves,Nemanja Bjelica,88.0,PF,28.0,6-10,240.0,Louisville,3950001.0
New Orleans Pelicans,Alexis Ajinca,42.0,C,28.0,7-2,248.0,California,4389607.0
New York Knicks,Arron Afflalo,4.0,SG,30.0,6-5,210.0,UCLA,8000000.0
Oklahoma City Thunder,Steven Adams,12.0,C,22.0,7-0,255.0,Pittsburgh,2279040.0
Orlando Magic,Dewayne Dedmon,3.0,C,26.0,7-0,245.0,USC,947276.0
Philadelphia 76ers,Elton Brand,42.0,PF,37.0,6-9,254.0,Duke,947276.0
Phoenix Suns,Eric Bledsoe,2.0,PG,26.0,6-1,190.0,Kentucky,13500000.0
Portland Trail Blazers,Cliff Alexander,34.0,PF,20.0,6-8,240.0,Kansas,525093.0
Sacramento Kings,Quincy Acy,13.0,SF,25.0,6-7,240.0,Baylor,981348.0
San Antonio Spurs,LaMarcus Aldridge,12.0,PF,30.0,6-11,240.0,Texas,19689000.0
Toronto Raptors,Bismack Biyombo,8.0,C,23.0,6-9,245.0,Missouri,2814000.0
Utah Jazz,Trevor Booker,33.0,PF,28.0,6-8,228.0,Clemson,4775000.0
Washington Wizards,Alan Anderson,6.0,SG,33.0,6-6,220.0,Michigan State,4000000.0

In [184]:
# Finding the values contained in the "Boston Celtics" group 
team.get_group("Boston Celtics")

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0
10,Jared Sullinger,Boston Celtics,7.0,C,24.0,6-9,260.0,Ohio State,2569260.0
11,Isaiah Thomas,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0
12,Evan Turner,Boston Celtics,11.0,SG,27.0,6-7,220.0,Ohio State,3425510.0
13,James Young,Boston Celtics,13.0,SG,20.0,6-6,215.0,Kentucky,1749840.0
14,Tyler Zeller,Boston Celtics,44.0,C,26.0,7-0,253.0,North Carolina,2616975.0

In [186]:
# First grouping based on "Team" 
# Within each team we are grouping based on "Position" 

team_position = df.groupby(["Team", "Position"])

# Print the first value in each group 

team_position.first()

                                         Name  Number   Age Height  Weight  \
Team               Position
Atlanta Hawks      C               Al Horford    15.0  30.0   6-10   245.0
                   PF          Kris Humphries    43.0  31.0    6-9   235.0
                   PG         Dennis Schroder    17.0  22.0    6-1   172.0
                   SF           Kent Bazemore    24.0  26.0    6-5   201.0
                   SG        Tim Hardaway Jr.    10.0  24.0    6-6   205.0
...                                       ...     ...   ...    ...     ...
Washington Wizards C            Marcin Gortat    13.0  32.0   6-11   240.0
                   PF             Drew Gooden    90.0  34.0   6-10   250.0
                   PG          Ramon Sessions     7.0  30.0    6-3   190.0
                   SF            Jared Dudley     1.0  30.0    6-7   225.0
                   SG           Alan Anderson     6.0  33.0    6-6   220.0

                                          College      Salary
Team               Position
Atlanta Hawks      C                      Florida  12000000.0
                   PF                   Minnesota   1000000.0
                   PG                 Wake Forest   1763400.0
                   SF                Old Dominion   2000000.0
                   SG                    Michigan   1304520.0
...                                           ...         ...
Washington Wizards C         North Carolina State  11217391.0
                   PF                      Kansas   3300000.0
                   PG                      Nevada   2170465.0
                   SF              Boston College   4375000.0
                   SG              Michigan State   4000000.0

[149 rows x 7 columns]

In [187]:
# Applying aggregation across all the columns  sum and min will be found for each  
# numeric type column in df dataframe 
  
df.aggregate(["sum", "max"])

C:\Users\jdche\AppData\Local\Temp\ipykernel_12864\1776159425.py:4: FutureWarning: ['Name', 'Team', 'Position', 'Height', 'College'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.aggregate(["sum", "max"])

     Number      Age    Weight        Salary
sum  8079.0  12311.0  101236.0  2.159837e+09
max    99.0     40.0     307.0  2.500000e+07

In [188]:
# We are going to find aggregation for these columns 
df.aggregate({ "Age":['max', 'min'], 
              "Weight":['max', 'min'],  
              "Salary":['sum']})

      Age  Weight        Salary
max  40.0   307.0           NaN
min  19.0   161.0           NaN
sum   NaN     NaN  2.159837e+09